.config/gnuemacs/config.org
#+TITLE: TL Emacs Config
#+AUTHOR: Trey Lewis <tldesktopenvironment@gmail.com>
#+PROPERTY: header-args :tangle config.el

* Package Management
** Setup package.el to work with MELPA.
#+begin_src emacs-lisp
(require 'package)
(add-to-list 'package-archives
             '("melpa" . "https://melpa.org/packages/"))
(package-refresh-contents)
(package-initialize)
#+end_src

** Install use-package
#+begin_src emacs-lisp
(unless (package-installed-p 'use-package)
  (package-install 'use-package))
(require 'use-package-ensure)
(setq use-package-always-ensure t)
(use-package auto-package-update
  :config
  (setq auto-package-update-delete-old-versions t)
  (setq auto-package-update-hide-results t)
  (auto-package-update-maybe))
#+end_src
  
* Keybindings
** Install general
Install the general.el keybind manager
#+begin_src emacs-lisp
(use-package general
  :config
  (general-evil-setup t))
#+end_src

** Setup generic SPC prefixed keybinds
Keybinds that start with space
#+begin_src emacs-lisp
(nvmap :prefix "SPC"
       "."     '(find-file :which-key "Find file")
       "SPC"   '(counsel-M-x :which-key "M-x")
       "h r r" '((lambda () (interactive) (load-file "~/.config/emacs/init.el")) :which-key "Reload emacs config")
       "f r"   '(counsel-recentf :which-key "Recent files"))
#+end_src

* Paste
#+begin_src emacs-lisp
(setq mouse-yank-at-point t)
#+end_src

* Startup Performance
#+begin_src emacs-lisp
(use-package gcmh
  :config
  (gcmh-mode 1))
(setq gc-cons-threshold 402653184
      gc-cons-percentage 0.6)
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "*** Emacs loaded in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                             (time-subtract after-init-time before-init-time)))
                     gcs-done)))
(setq comp-async-report-warnings-errors nil)
(if (boundp 'comp-deferred-compilation)
    (setq comp-deferred-compilation nil)
    (setq native-comp-deferred-compilation nil))
(setq load-prefer-newer noninteractive)
#+end_src

* All The Icons
#+begin_src emacs-lisp
(use-package all-the-icons)
#+end_src

* Evil Mode
#+begin_src emacs-lisp
(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-vsplit-window-right t)
  (setq evil-split-window-below t)
  (evil-mode))
(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))
(use-package undo-tree
  :after evil
  :diminish
  :config
  (evil-set-undo-system 'undo-tree)
  (global-undo-tree-mode 1))
#+end_src

* Fonts
Sets up font as RobotoMono Nerd Font at size 11
#+begin_src emacs-lisp
(set-face-attribute 'default nil
            :font "RobotoMono Nerd Font 11"
            :weight 'medium)
(set-face-attribute 'variable-pitch nil
            :font "RobotoMono Nerd Font 11"
            :weight 'medium)
(set-face-attribute 'fixed-pitch nil
            :font "RobotoMono Nerd Font 11"
            :weight 'medium)

(add-to-list 'default-frame-alist '(font . "RobotoMono Nerd Font 11"))
#+end_src

* Ivy
#+begin_src emacs-lisp
(use-package counsel
  :after ivy
  :config (counsel-mode))
(use-package ivy
  :defer 0.1
  :diminish
  :custom
  (setq ivy-count-format "(%d/%d) ")
  (setq ivy-use-virtual-buffers t)
  (setq enable-recursive-minibuffers t)
  :config
  (ivy-mode))
(use-package ivy-rich
  :after ivy
  :custom
  (ivy-virtual-abbreviate 'full
   ivy-rich-switch-buffer-align-virtual-buffer t
   ivy-rich-path-style 'abbrev)
  :config
  (ivy-set-display-transformer 'ivy-switch-buffer
                               'ivy-rich-switch-buffer-transformer)
  (ivy-rich-mode))
(use-package swiper
  :after ivy
  :bind (("C-s" . swiper)
         ("C-r" . swiper)))
(setq ivy-initial-inputs-alist nil)
(use-package smex)
(smex-initialize)
(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))
#+end_src

* Language Support
** Install lsp-mode
#+begin_src emacs-lisp
(use-package lsp-mode
  :init
  (setq lsp-keymap-prefix "C-c l")
  :hook (
         (lsp-mode . lsp-enable-which-key-integration))
  :commands lsp)

(use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
#+end_src

** Install Company
#+begin_src emacs-lisp
(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
         ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))

(use-package company-box
  :hook (company-mode . company-box-mode))
#+end_src

** Install Rainbow Delimiters
Colors parentheses
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

** Install format-all
#+begin_src emacs-lisp
(use-package format-all)
(add-hook 'prog-mode-hook 'format-all-mode)
#+end_src

** Install flycheck
#+begin_src emacs-lisp
(use-package flycheck
  :init (global-flycheck-mode))
#+end_src

** Rust
#+begin_src emacs-lisp
(use-package rustic)
(setq rustic-babel-format-src-block nil
      rustic-format-trigger nil)
#+end_src

** Haskell
#+begin_src emacs-lisp
(use-package lsp-haskell)
(add-hook 'haskell-mode-hook #'lsp)
(add-hook 'haskell-literate-mode-hook #'lsp)
(setq lsp-haskell-hlint-on nil)
(setq lsp-haskell-server-path "~/.ghcup/bin/haskell-language-server-wrapper")
#+end_src

** YAML
#+begin_src emacs-lisp
(use-package yaml-mode)
#+end_src

** Indents
#+begin_src emacs-lisp
(use-package highlight-indent-guides
  :hook ((prog-mode text-mode conf-mode) . highlight-indent-guides-mode)
  :init
  (setq highlight-indent-guides-method 'character
        highlight-indent-guides-suppress-auto-error t))
#+end_src

* vterm
#+begin_src emacs-lisp
(use-package vterm
  :when (bound-and-true-p module-file-suffix)
  :commands vterm-mode
  :hook (vterm-mode . doom-mark-buffer-as-real-h)
  :hook (vterm-mode . hide-mode-line-mode)
  :init
  (when noninteractive
    (advice-add #'vterm-module-compile :override #'ignore)
    (provide 'vterm-module))
  :config
  (setq vterm-kill-buffer-on-exit t)
  (setq vterm-max-scrollback 5000))
#+end_src

* Org Mode
#+begin_src emacs-lisp
(use-package org-bullets)
(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
(add-hook 'org-mode-hook 'org-indent-mode)
(setq org-directory "~/Org/"
      org-agenda-files '("~/Org/agenda.org")
      org-default-notes-file (expand-file-name "notes.org" org-directory)
      org-ellipsis " ▼ "
      org-log-done 'time
      org-journal-dir "~/Org/journal/"
      org-journal-date-format "%B %d, %Y (%A) "
      org-journal-file-format "%Y-%m-%d.org"
      org-hide-emphasis-markers t
      org-link-abbrev-alist
        '(("google" . "http://www.google.com/search?q=")
          ("arch-wiki" . "https://wiki.archlinux.org/index.php/")
          ("ddg" . "https://duckduckgo.com/?q=")
          ("wiki" . "https://en.wikipedia.org/wiki/")))
(setq org-src-preserve-indentation nil
      org-src-tab-acts-natively t
      org-edit-src-content-indentation 0)
(setq org-blank-before-new-entry (quote ((heading . nil)
                                         (plain-list-item . nil))))
(setq org-src-fontify-natively t
      org-src-tab-acts-natively t
      org-confirm-babel-evaluate nil
      org-edit-src-content-indentation 0)
(use-package org-tempo
  :ensure nil)
#+end_src
  
* Projectile
#+begin_src emacs-lisp
(use-package projectile
  :config
  (projectile-global-mode 1))
#+end_src
  
* Theme
** Install the doom-one theme
#+begin_src emacs-lisp
(use-package doom-themes)
(setq doom-themes-enable-bold t
      doom-themes-enable-italic t)
(load-theme 'doom-one t)
#+end_src

** Disable menu, toolbar, and scrollbar
#+begin_src emacs-lisp
(menu-bar-mode -1)
(tool-bar-mode -1)
(scroll-bar-mode -1)
#+end_src

** Install doom-modeline
#+begin_src emacs-lisp
(use-package doom-modeline)
(doom-modeline-mode 1)
#+end_src
  
** Dashboard
#+begin_src emacs-lisp
(use-package dashboard
  :init
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
  (setq dashboard-banner-logo-title "Emacs is More Than A Text Editor!")
  (setq dashboard-startup-banner 'logo)
  (setq dashboard-center-content t)
  (setq dashboard-items '((recents . 10)
                          (agenda . 5)
                          (projects . 5)))
  :config
  (dashboard-setup-startup-hook)
  (dashboard-modify-heading-icons '((recents . "file-text")
                                    (bookmarks . "book"))))
(setq initial-buffer-choice (lambda () (get-buffer "*dashboard*")))
#+end_src

** Enable line numbers and truncate lines
#+begin_src emacs-lisp
(global-display-line-numbers-mode 1)
(global-visual-line-mode t)
#+end_src

** Disable fringes
#+begin_src emacs-lisp
(lambda () (interactive) (fringe-mode "no-fringes"))
#+end_src

* Which Key
Allows for completion tooltips on commands
#+begin_src emacs-lisp
(use-package which-key)
(which-key-mode)
#+end_src
